#{{{ 0 0
#datalayer
#}}}
#{{{ 0 3000
layer {
  name: "Concat1"
  type: "Concat"
  bottom: "blob3"
  bottom: "blob2"
  top: "camera"
}
layer {
  name: "Median3x3Downsample1"
  type: "Median3x3Downsample"
  bottom: "blob1"
  top: "blob4"
}
layer {
  name: "Median3x3Downsample2"
  type: "Median3x3Downsample"
  bottom: "blob4"
  top: "depth2"
}
layer {
  name: "Median3x3Downsample3"
  type: "Median3x3Downsample"
  bottom: "depth2"
  top: "blob5"
}
layer {
  name: "Median3x3Downsample4"
  type: "Median3x3Downsample"
  bottom: "blob5"
  top: "blob6"
}
layer {
  name: "Median3x3Downsample5"
  type: "Median3x3Downsample"
  bottom: "blob6"
  top: "depth5"
}
layer {
  name: "Power1"
  type: "Power"
  bottom: "depth2"
  top: "blob7"
  power_param {
    power: -1
    scale: 1
    shift: 0
  }
}
layer {
  name: "DepthToFlow1"
  type: "DepthToFlow"
  bottom: "blob7"
  bottom: "camera"
  top: "flow2"
  depthtoflow_param {
    max_flow_length_factor: 1
    normalize_flow: true
  }
}
layer {
  name: "Power2"
  type: "Power"
  bottom: "depth5"
  top: "blob8"
  power_param {
    power: -1
    scale: 1
    shift: 0
  }
}
layer {
  name: "DepthToFlow2"
  type: "DepthToFlow"
  bottom: "blob8"
  bottom: "camera"
  top: "flow5"
  depthtoflow_param {
    max_flow_length_factor: 1
    normalize_flow: true
  }
}
layer {
  name: "Power3"
  type: "Power"
  bottom: "depth2"
  top: "blob9"
  power_param {
    power: -1
    scale: 1
    shift: 0
  }
}
layer {
  name: "DepthToNormals1"
  type: "DepthToNormals"
  bottom: "blob9"
  bottom: "blob3"
  top: "normal2"
}
#}}}
#{{{ 400 0
layer {
  name: "netFlow_passthrough"
  type: "RandomOutputSelection"
  bottom: "blob0"
  top: "netFlow_image_pair_"
  propagate_down: false
  randomoutputselection_param {
    output_combinations {
      probability: 1
      blobs {
        bottom_id: 0
      }
    }
  }
}
#}}}
#{{{ 800 300
layer {
  name: "netFlow_conv1y"
  type: "Convolution"
  bottom: "netFlow_image_pair_"
  top: "blob10"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 4
    pad: 0
    kernel_size: 9
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU1"
  type: "ReLU"
  bottom: "blob10"
  top: "blob10"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv1x"
  type: "Convolution"
  bottom: "blob10"
  top: "netFlow_conv1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    pad: 4
    kernel_size: 1
    kernel_size: 9
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU2"
  type: "ReLU"
  bottom: "netFlow_conv1"
  top: "netFlow_conv1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 1200 600
layer {
  name: "netFlow_conv2y"
  type: "Convolution"
  bottom: "netFlow_conv1"
  top: "blob11"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    pad: 0
    kernel_size: 7
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU3"
  type: "ReLU"
  bottom: "blob11"
  top: "blob11"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv2x"
  type: "Convolution"
  bottom: "blob11"
  top: "netFlow_conv2"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    pad: 3
    kernel_size: 1
    kernel_size: 7
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU4"
  type: "ReLU"
  bottom: "netFlow_conv2"
  top: "netFlow_conv2"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv2_1y"
  type: "Convolution"
  bottom: "netFlow_conv2"
  top: "blob12"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU5"
  type: "ReLU"
  bottom: "blob12"
  top: "blob12"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv2_1x"
  type: "Convolution"
  bottom: "blob12"
  top: "netFlow_conv2_1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU6"
  type: "ReLU"
  bottom: "netFlow_conv2_1"
  top: "netFlow_conv2_1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 1600 900
layer {
  name: "netFlow_conv3y"
  type: "Convolution"
  bottom: "netFlow_conv2_1"
  top: "blob13"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    pad: 0
    kernel_size: 5
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU7"
  type: "ReLU"
  bottom: "blob13"
  top: "blob13"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv3x"
  type: "Convolution"
  bottom: "blob13"
  top: "netFlow_conv3"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    pad: 2
    kernel_size: 1
    kernel_size: 5
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU8"
  type: "ReLU"
  bottom: "netFlow_conv3"
  top: "netFlow_conv3"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv3_1y"
  type: "Convolution"
  bottom: "netFlow_conv3"
  top: "blob14"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU9"
  type: "ReLU"
  bottom: "blob14"
  top: "blob14"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv3_1x"
  type: "Convolution"
  bottom: "blob14"
  top: "netFlow_conv3_1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU10"
  type: "ReLU"
  bottom: "netFlow_conv3_1"
  top: "netFlow_conv3_1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 2000 1200
layer {
  name: "netFlow_conv4y"
  type: "Convolution"
  bottom: "netFlow_conv3_1"
  top: "blob15"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    pad: 0
    kernel_size: 5
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU11"
  type: "ReLU"
  bottom: "blob15"
  top: "blob15"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv4x"
  type: "Convolution"
  bottom: "blob15"
  top: "netFlow_conv4"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    pad: 2
    kernel_size: 1
    kernel_size: 5
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU12"
  type: "ReLU"
  bottom: "netFlow_conv4"
  top: "netFlow_conv4"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv4_1y"
  type: "Convolution"
  bottom: "netFlow_conv4"
  top: "blob16"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU13"
  type: "ReLU"
  bottom: "blob16"
  top: "blob16"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv4_1x"
  type: "Convolution"
  bottom: "blob16"
  top: "netFlow_conv4_1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU14"
  type: "ReLU"
  bottom: "netFlow_conv4_1"
  top: "netFlow_conv4_1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 2400 1500
layer {
  name: "netFlow_conv5y"
  type: "Convolution"
  bottom: "netFlow_conv4_1"
  top: "blob17"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2
    pad: 0
    kernel_size: 5
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU15"
  type: "ReLU"
  bottom: "blob17"
  top: "blob17"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv5x"
  type: "Convolution"
  bottom: "blob17"
  top: "netFlow_conv5"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    pad: 2
    kernel_size: 1
    kernel_size: 5
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU16"
  type: "ReLU"
  bottom: "netFlow_conv5"
  top: "netFlow_conv5"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv5_1y"
  type: "Convolution"
  bottom: "netFlow_conv5"
  top: "blob18"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU17"
  type: "ReLU"
  bottom: "blob18"
  top: "blob18"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_conv5_1x"
  type: "Convolution"
  bottom: "blob18"
  top: "netFlow_conv5_1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU18"
  type: "ReLU"
  bottom: "netFlow_conv5_1"
  top: "netFlow_conv5_1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 2800 1500
layer {
  name: "netFlow_predict_flow5"
  type: "Convolution"
  bottom: "netFlow_conv5_1"
  top: "blob19"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU19"
  type: "ReLU"
  bottom: "blob19"
  top: "blob19"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_predict_flow5_1"
  type: "Convolution"
  bottom: "blob19"
  top: "netFlow_predict_flowconf5"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 4
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_Slice1"
  type: "Slice"
  bottom: "netFlow_predict_flowconf5"
  top: "blob20"
  top: "blob21"
  slice_param {
    slice_point: 2
    axis: 1
  }
}
layer {
  name: "netFlow_LocalL2Loss1"
  type: "LocalL2Loss"
  bottom: "blob20"
  bottom: "flow5"
  top: "netFlow_flow_loss5_l1"
  loss_weight: 500.0
  locall2_loss_param {
    normalize_by_num_valid: true
    normalize_min_percentage: 0.5
  }
}
layer {
  name: "netFlow_Eltwise1"
  type: "Eltwise"
  bottom: "blob20"
  bottom: "flow5"
  top: "blob22"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: -1
  }
}
layer {
  name: "netFlow_AbsVal1"
  type: "AbsVal"
  bottom: "blob22"
  top: "blob23"
}
layer {
  name: "netFlow_Exp1"
  type: "Exp"
  bottom: "blob23"
  top: "blob24"
  exp_param {
    scale: -1
  }
}
layer {
  name: "netFlow_LocalL2Loss2"
  type: "LocalL2Loss"
  bottom: "blob21"
  bottom: "blob24"
  top: "netFlow_conf_loss5_l1"
  loss_weight: 250.0
  propagate_down: true
  propagate_down: false
  locall2_loss_param {
    normalize_by_num_valid: true
    normalize_min_percentage: 0.5
  }
}
#}}}
#{{{ 3200 1500
layer {
  name: "netFlow_upsample_5to4"
  type: "Deconvolution"
  bottom: "netFlow_predict_flowconf5"
  top: "netFlow_predict_flowconf5to4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
#}}}
#{{{ 3600 1200
layer {
  name: "netFlow_deconv4"
  type: "Deconvolution"
  bottom: "netFlow_conv5_1"
  top: "blob25"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU20"
  type: "ReLU"
  bottom: "blob25"
  top: "blob25"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_concat4"
  type: "Concat"
  bottom: "blob25"
  bottom: "netFlow_conv4_1"
  bottom: "netFlow_predict_flowconf5to4"
  top: "netFlow_concat4"
}
#}}}
#{{{ 4000 900
layer {
  name: "netFlow_deconv3"
  type: "Deconvolution"
  bottom: "netFlow_concat4"
  top: "blob26"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU21"
  type: "ReLU"
  bottom: "blob26"
  top: "blob26"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_concat3"
  type: "Concat"
  bottom: "blob26"
  bottom: "netFlow_conv3_1"
  top: "netFlow_concat3"
}
#}}}
#{{{ 4400 600
layer {
  name: "netFlow_deconv2"
  type: "Deconvolution"
  bottom: "netFlow_concat3"
  top: "blob27"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU22"
  type: "ReLU"
  bottom: "blob27"
  top: "blob27"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_concat2"
  type: "Concat"
  bottom: "blob27"
  bottom: "netFlow_conv2_1"
  top: "netFlow_concat2"
}
#}}}
#{{{ 4800 600
layer {
  name: "netFlow_predict_flow2"
  type: "Convolution"
  bottom: "netFlow_concat2"
  top: "blob28"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_ReLU23"
  type: "ReLU"
  bottom: "blob28"
  top: "blob28"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow_predict_flow2_1"
  type: "Convolution"
  bottom: "blob28"
  top: "netFlow_predict_flowconf2"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 4
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow_Slice2"
  type: "Slice"
  bottom: "netFlow_predict_flowconf2"
  top: "blob29"
  top: "blob30"
  slice_param {
    slice_point: 2
    axis: 1
  }
}
layer {
  name: "netFlow_LocalL2Loss3"
  type: "LocalL2Loss"
  bottom: "blob29"
  bottom: "flow2"
  top: "netFlow_flow_loss2_l1"
  loss_weight: 1000
  locall2_loss_param {
    normalize_by_num_valid: true
    normalize_min_percentage: 0.5
  }
}
layer {
  name: "netFlow_flow_loss2_prgrad"
  type: "NormalizedGrad"
  bottom: "blob29"
  top: "blob31"
  normalizedgrad_param {
    comparisons: 5
  }
}
layer {
  name: "netFlow_flow_loss2_gtgrad"
  type: "NormalizedGrad"
  bottom: "flow2"
  top: "blob32"
  normalizedgrad_param {
    comparisons: 5
  }
}
layer {
  name: "netFlow_LocalL2Loss4"
  type: "LocalL2Loss"
  bottom: "blob31"
  bottom: "blob32"
  top: "netFlow_flow_loss2_l1grad"
  loss_weight: 1000
  locall2_loss_param {
    normalize_by_num_valid: true
    normalize_min_percentage: 0.5
  }
}
layer {
  name: "netFlow_Eltwise2"
  type: "Eltwise"
  bottom: "blob29"
  bottom: "flow2"
  top: "blob33"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: -1
  }
}
layer {
  name: "netFlow_AbsVal2"
  type: "AbsVal"
  bottom: "blob33"
  top: "blob34"
}
layer {
  name: "netFlow_Exp2"
  type: "Exp"
  bottom: "blob34"
  top: "blob35"
  exp_param {
    scale: -1
  }
}
layer {
  name: "netFlow_LocalL2Loss5"
  type: "LocalL2Loss"
  bottom: "blob30"
  bottom: "blob35"
  top: "netFlow_conf_loss2_l1"
  loss_weight: 500.0
  propagate_down: true
  propagate_down: false
  locall2_loss_param {
    normalize_by_num_valid: true
    normalize_min_percentage: 0.5
  }
}
layer {
  name: "netFlow_conf_loss2_prgrad"
  type: "NormalizedGrad"
  bottom: "blob30"
  top: "blob36"
  normalizedgrad_param {
    comparisons: 5
  }
}
layer {
  name: "netFlow_conf_loss2_gtgrad"
  type: "NormalizedGrad"
  bottom: "blob35"
  top: "blob37"
  normalizedgrad_param {
    comparisons: 5
  }
}
layer {
  name: "netFlow_LocalL2Loss6"
  type: "LocalL2Loss"
  bottom: "blob36"
  bottom: "blob37"
  top: "netFlow_conf_loss2_l1grad"
  loss_weight: 1000
  propagate_down: true
  propagate_down: false
  locall2_loss_param {
    normalize_by_num_valid: true
    normalize_min_percentage: 0.5
  }
}
#}}}
#{{{ 4800 2000
layer {
  name: "netDM_Slice1"
  type: "Slice"
  bottom: "blob2"
  top: "blob38"
  top: "blob39"
  slice_param {
    slice_point: 3
    axis: 1
  }
}
#}}}
#{{{ 5200 0
layer {
  name: "netDM_passthrough"
  type: "RandomOutputSelection"
  bottom: "blob0"
  bottom: "netFlow_predict_flowconf2"
  top: "netDM_image_pair_"
  top: "netDM_prev_flowconf2_"
  propagate_down: false
  propagate_down: false
  randomoutputselection_param {
    output_combinations {
      probability: 1
      blobs {
        bottom_id: 0
      }
      blobs {
        bottom_id: 1
      }
    }
  }
}
#}}}
#{{{ 5600 0
layer {
  name: "netDM_conv1y"
  type: "Convolution"
  bottom: "netDM_image_pair_"
  top: "blob40"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 4
    pad: 0
    kernel_size: 9
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU1"
  type: "ReLU"
  bottom: "blob40"
  top: "blob40"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv1x"
  type: "Convolution"
  bottom: "blob40"
  top: "netDM_conv1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    pad: 4
    kernel_size: 1
    kernel_size: 9
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU2"
  type: "ReLU"
  bottom: "netDM_conv1"
  top: "netDM_conv1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 6000 300
layer {
  name: "netDM_conv2y"
  type: "Convolution"
  bottom: "netDM_conv1"
  top: "blob41"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 3
    pad: 0
    kernel_size: 7
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU3"
  type: "ReLU"
  bottom: "blob41"
  top: "blob41"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv2x"
  type: "Convolution"
  bottom: "blob41"
  top: "netDM_conv2"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    pad: 3
    kernel_size: 1
    kernel_size: 7
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU4"
  type: "ReLU"
  bottom: "netDM_conv2"
  top: "netDM_conv2"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_Slice2"
  type: "Slice"
  bottom: "netDM_image_pair_"
  top: "blob42"
  top: "blob43"
  slice_param {
    slice_point: 3
    axis: 1
  }
}
layer {
  name: "netDM_Median3x3Downsample1"
  type: "Median3x3Downsample"
  bottom: "blob43"
  top: "blob44"
}
layer {
  name: "netDM_Median3x3Downsample2"
  type: "Median3x3Downsample"
  bottom: "blob44"
  top: "blob45"
}
layer {
  name: "netDM_Slice3"
  type: "Slice"
  bottom: "netDM_prev_flowconf2_"
  top: "blob46"
  top: "blob47"
  slice_param {
    slice_point: 2
    axis: 1
  }
}
layer {
  name: "netDM_FlowNormalize1"
  type: "FlowNormalize"
  bottom: "blob46"
  top: "blob48"
  flownormalize_param {
    denormalize: true
  }
}
layer {
  name: "netDM_FlowWarp1"
  type: "FlowWarp"
  bottom: "blob45"
  bottom: "blob48"
  top: "blob49"
}
layer {
  name: "netDM_concat_extra_inputs"
  type: "Concat"
  bottom: "blob49"
  bottom: "netDM_prev_flowconf2_"
  top: "netDM_concat_extra_inputs"
  propagate_down: false
  propagate_down: false
}
layer {
  name: "netDM_conv2_extra_inputsy"
  type: "Convolution"
  bottom: "netDM_concat_extra_inputs"
  top: "blob50"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU5"
  type: "ReLU"
  bottom: "blob50"
  top: "blob50"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv2_extra_inputsx"
  type: "Convolution"
  bottom: "blob50"
  top: "netDM_conv_extra_inputs"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU6"
  type: "ReLU"
  bottom: "netDM_conv_extra_inputs"
  top: "netDM_conv_extra_inputs"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_concat_conv2__conv_extra_inputs"
  type: "Concat"
  bottom: "netDM_conv2"
  bottom: "netDM_conv_extra_inputs"
  top: "netDM_conv2_concat"
}
layer {
  name: "netDM_conv2_1y"
  type: "Convolution"
  bottom: "netDM_conv2_concat"
  top: "blob51"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU7"
  type: "ReLU"
  bottom: "blob51"
  top: "blob51"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv2_1x"
  type: "Convolution"
  bottom: "blob51"
  top: "netDM_conv2_1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU8"
  type: "ReLU"
  bottom: "netDM_conv2_1"
  top: "netDM_conv2_1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 6400 600
layer {
  name: "netDM_conv3y"
  type: "Convolution"
  bottom: "netDM_conv2_1"
  top: "blob52"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    pad: 0
    kernel_size: 5
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU9"
  type: "ReLU"
  bottom: "blob52"
  top: "blob52"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv3x"
  type: "Convolution"
  bottom: "blob52"
  top: "netDM_conv3"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    pad: 2
    kernel_size: 1
    kernel_size: 5
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU10"
  type: "ReLU"
  bottom: "netDM_conv3"
  top: "netDM_conv3"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv3_1y"
  type: "Convolution"
  bottom: "netDM_conv3"
  top: "blob53"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU11"
  type: "ReLU"
  bottom: "blob53"
  top: "blob53"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv3_1x"
  type: "Convolution"
  bottom: "blob53"
  top: "netDM_conv3_1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU12"
  type: "ReLU"
  bottom: "netDM_conv3_1"
  top: "netDM_conv3_1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 6800 900
layer {
  name: "netDM_conv4y"
  type: "Convolution"
  bottom: "netDM_conv3_1"
  top: "blob54"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    pad: 0
    kernel_size: 5
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU13"
  type: "ReLU"
  bottom: "blob54"
  top: "blob54"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv4x"
  type: "Convolution"
  bottom: "blob54"
  top: "netDM_conv4"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    pad: 2
    kernel_size: 1
    kernel_size: 5
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU14"
  type: "ReLU"
  bottom: "netDM_conv4"
  top: "netDM_conv4"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv4_1y"
  type: "Convolution"
  bottom: "netDM_conv4"
  top: "blob55"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU15"
  type: "ReLU"
  bottom: "blob55"
  top: "blob55"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv4_1x"
  type: "Convolution"
  bottom: "blob55"
  top: "netDM_conv4_1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU16"
  type: "ReLU"
  bottom: "netDM_conv4_1"
  top: "netDM_conv4_1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 7200 1200
layer {
  name: "netDM_conv5y"
  type: "Convolution"
  bottom: "netDM_conv4_1"
  top: "blob56"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU17"
  type: "ReLU"
  bottom: "blob56"
  top: "blob56"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv5x"
  type: "Convolution"
  bottom: "blob56"
  top: "netDM_conv5"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU18"
  type: "ReLU"
  bottom: "netDM_conv5"
  top: "netDM_conv5"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv5_1y"
  type: "Convolution"
  bottom: "netDM_conv5"
  top: "blob57"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU19"
  type: "ReLU"
  bottom: "blob57"
  top: "blob57"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_conv5_1x"
  type: "Convolution"
  bottom: "blob57"
  top: "netDM_conv5_1"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU20"
  type: "ReLU"
  bottom: "netDM_conv5_1"
  top: "netDM_conv5_1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 7500 1600
layer {
  name: "netDM_motion_conv1"
  type: "Convolution"
  bottom: "netDM_conv5_1"
  top: "netDM_motion_conv"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU21"
  type: "ReLU"
  bottom: "netDM_motion_conv"
  top: "netDM_motion_conv"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_motion_fc1"
  type: "InnerProduct"
  bottom: "netDM_motion_conv"
  top: "netDM_motion_fc1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "netDM_ReLU22"
  type: "ReLU"
  bottom: "netDM_motion_fc1"
  top: "netDM_motion_fc1"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "netDM_motion_fc2"
  type: "InnerProduct"
  bottom: "netDM_motion_fc1"
  top: "netDM_motion_fc2"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "netDM_ReLU23"
  type: "ReLU"
  bottom: "netDM_motion_fc2"
  top: "netDM_motion_fc2"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "netDM_motion_fc3"
  type: "InnerProduct"
  bottom: "netDM_motion_fc2"
  top: "netDM_predict_motion_scale"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 7
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "netDM_Slice4"
  type: "Slice"
  bottom: "netDM_predict_motion_scale"
  top: "netDM_predict_motion"
  top: "netDM_predict_scale"
  slice_param {
    slice_point: 6
    axis: 1
  }
}
layer {
  name: "netDM_Slice5"
  type: "Slice"
  bottom: "netDM_predict_motion"
  top: "blob58"
  top: "blob59"
  slice_param {
    slice_point: 3
    axis: 1
  }
}
layer {
  name: "netDM_L1Loss1"
  type: "L1Loss"
  bottom: "blob58"
  bottom: "blob38"
  top: "netDM_motion_loss_rotation"
  loss_weight: 160
}
layer {
  name: "netDM_L1Loss2"
  type: "L1Loss"
  bottom: "blob59"
  bottom: "blob39"
  top: "netDM_motion_loss_translation"
  loss_weight: 15
}
#}}}
#{{{ 7600 900
layer {
  name: "netDM_deconv4"
  type: "Deconvolution"
  bottom: "netDM_conv5_1"
  top: "blob60"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU24"
  type: "ReLU"
  bottom: "blob60"
  top: "blob60"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_concat4"
  type: "Concat"
  bottom: "blob60"
  bottom: "netDM_conv4_1"
  top: "netDM_concat4"
}
#}}}
#{{{ 8000 600
layer {
  name: "netDM_deconv3"
  type: "Deconvolution"
  bottom: "netDM_concat4"
  top: "blob61"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU25"
  type: "ReLU"
  bottom: "blob61"
  top: "blob61"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_concat3"
  type: "Concat"
  bottom: "blob61"
  bottom: "netDM_conv3_1"
  top: "netDM_concat3"
}
#}}}
#{{{ 8400 300
layer {
  name: "netDM_deconv2"
  type: "Deconvolution"
  bottom: "netDM_concat3"
  top: "blob62"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU26"
  type: "ReLU"
  bottom: "blob62"
  top: "blob62"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_concat2"
  type: "Concat"
  bottom: "blob62"
  bottom: "netDM_conv2_1"
  top: "netDM_concat2"
}
#}}}
#{{{ 8800 300
layer {
  name: "netDM_predict_depth2"
  type: "Convolution"
  bottom: "netDM_concat2"
  top: "blob63"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_ReLU27"
  type: "ReLU"
  bottom: "blob63"
  top: "blob63"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netDM_predict_depth2_1"
  type: "Convolution"
  bottom: "blob63"
  top: "blob64"
  param {
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 4
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netDM_Slice6"
  type: "Slice"
  bottom: "blob64"
  top: "blob65"
  top: "blob66"
  slice_param {
    slice_point: 1
    axis: 1
  }
}
layer {
  name: "netDM_Scale1"
  type: "Scale"
  bottom: "blob65"
  bottom: "netDM_predict_scale"
  top: "blob67"
  scale_param {
    axis: 0
  }
}
layer {
  name: "netDM_LocalL2Loss1"
  type: "LocalL2Loss"
  bottom: "blob67"
  bottom: "depth2"
  top: "netDM_depth_loss2_l1"
  loss_weight: 300
  locall2_loss_param {
    normalize_by_num_valid: true
    normalize_min_percentage: 0.5
  }
}
layer {
  name: "netDM_depth_loss2_prgrad"
  type: "NormalizedGrad"
  bottom: "blob67"
  top: "blob68"
  normalizedgrad_param {
    comparisons: 5
  }
}
layer {
  name: "netDM_depth_loss2_gtgrad"
  type: "NormalizedGrad"
  bottom: "depth2"
  top: "blob69"
  normalizedgrad_param {
    comparisons: 5
  }
}
layer {
  name: "netDM_LocalL2Loss2"
  type: "LocalL2Loss"
  bottom: "blob68"
  bottom: "blob69"
  top: "netDM_depth_loss2_l1grad"
  loss_weight: 1500
  locall2_loss_param {
    normalize_by_num_valid: true
    normalize_min_percentage: 0.5
  }
}
layer {
  name: "netDM_LocalL2Loss3"
  type: "LocalL2Loss"
  bottom: "blob66"
  bottom: "normal2"
  top: "netDM_normal_loss2_l1"
  loss_weight: 100
  locall2_loss_param {
    normalize_by_num_valid: true
    normalize_min_percentage: 0.5
  }
}
#}}}
#{{{ 8800 300
layer {
  name: "netDM_Concat1"
  type: "Concat"
  bottom: "blob67"
  bottom: "blob66"
  top: "netDM_predict_depthnormal2"
}
#}}}
#{{{ 9300 0
layer {
  name: "teleporter_exit"
  type: "Teleporter"
  bottom: "blob0"
  bottom: "blob1"
  bottom: "blob2"
  bottom: "depth2"
  bottom: "depth5"
  bottom: "normal2"
  bottom: "camera"
  bottom: "blob3"
  bottom: "flow2"
  bottom: "flow5"
  bottom: "netFlow_predict_flowconf2"
  bottom: "netDM_predict_depthnormal2"
  bottom: "netDM_predict_motion"
  top: "blob70"
  top: "blob71"
  top: "blob72"
  top: "blob73"
  top: "blob74"
  top: "blob75"
  top: "blob76"
  top: "blob77"
  top: "blob78"
  top: "blob79"
  top: "blob80"
  top: "blob81"
  top: "blob82"
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  propagate_down: false
  teleporter_param {
    id: "A"
    max_batch_size: 32
  }
}
#}}}
#{{{ 9700 0
layer {
  name: "netFlow2_passthrough"
  type: "RandomOutputSelection"
  bottom: "blob70"
  bottom: "blob81"
  bottom: "blob82"
  top: "netFlow2_image_pair_"
  top: "netFlow2_prev_depthnormal2_"
  top: "netFlow2_prev_motion_"
  propagate_down: false
  propagate_down: false
  propagate_down: false
  randomoutputselection_param {
    output_combinations {
      probability: 1
      blobs {
        bottom_id: 0
      }
      blobs {
        bottom_id: 1
      }
      blobs {
        bottom_id: 2
      }
    }
  }
}
#}}}
#{{{ 10100 300
layer {
  name: "netFlow2_conv1y"
  type: "Convolution"
  bottom: "netFlow2_image_pair_"
  top: "blob83"
  param {
    name: "flow_conv1y_w"
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    name: "flow_conv1y_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 4
    pad: 0
    kernel_size: 9
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_ReLU1"
  type: "ReLU"
  bottom: "blob83"
  top: "blob83"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_conv1x"
  type: "Convolution"
  bottom: "blob83"
  top: "netFlow2_conv1"
  param {
    name: "flow_conv1x_w"
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    name: "flow_conv1x_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    pad: 4
    kernel_size: 1
    kernel_size: 9
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_ReLU2"
  type: "ReLU"
  bottom: "netFlow2_conv1"
  top: "netFlow2_conv1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 10500 600
layer {
  name: "netFlow2_conv2y"
  type: "Convolution"
  bottom: "netFlow2_conv1"
  top: "blob84"
  param {
    name: "flow_conv2y_w"
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    name: "flow_conv2y_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 3
    pad: 0
    kernel_size: 7
    kernel_size: 1
    stride: 2
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_ReLU3"
  type: "ReLU"
  bottom: "blob84"
  top: "blob84"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_conv2x"
  type: "Convolution"
  bottom: "blob84"
  top: "netFlow2_conv2"
  param {
    name: "flow_conv2x_w"
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    name: "flow_conv2x_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    pad: 3
    kernel_size: 1
    kernel_size: 7
    stride: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_ReLU4"
  type: "ReLU"
  bottom: "netFlow2_conv2"
  top: "netFlow2_conv2"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_Slice1"
  type: "Slice"
  bottom: "netFlow2_image_pair_"
  top: "blob85"
  top: "blob86"
  slice_param {
    slice_point: 3
    axis: 1
  }
}
layer {
  name: "netFlow2_Median3x3Downsample1"
  type: "Median3x3Downsample"
  bottom: "blob86"
  top: "blob87"
}
layer {
  name: "netFlow2_Median3x3Downsample2"
  type: "Median3x3Downsample"
  bottom: "blob87"
  top: "blob88"
}
layer {
  name: "netFlow2_Slice2"
  type: "Slice"
  bottom: "netFlow2_prev_depthnormal2_"
  top: "blob89"
  top: "blob90"
  slice_param {
    slice_point: 1
    axis: 1
  }
}
layer {
  name: "netFlow2_Concat1"
  type: "Concat"
  bottom: "blob77"
  bottom: "netFlow2_prev_motion_"
  top: "blob91"
}
layer {
  name: "netFlow2_Power1"
  type: "Power"
  bottom: "blob89"
  top: "blob92"
  power_param {
    power: -1
    scale: 1
    shift: 0
  }
}
layer {
  name: "netFlow2_DepthToFlow1"
  type: "DepthToFlow"
  bottom: "blob92"
  bottom: "blob91"
  top: "blob93"
  depthtoflow_param {
    max_flow_length_factor: 1
    normalize_flow: true
  }
}
layer {
  name: "netFlow2_DelInf1"
  type: "DelInf"
  bottom: "blob93"
  top: "blob94"
  delinf_param {
    replace_value: 0
  }
}
layer {
  name: "netFlow2_FlowNormalize1"
  type: "FlowNormalize"
  bottom: "blob94"
  top: "blob95"
  flownormalize_param {
    denormalize: true
  }
}
layer {
  name: "netFlow2_FlowWarp1"
  type: "FlowWarp"
  bottom: "blob88"
  bottom: "blob95"
  top: "blob96"
}
layer {
  name: "netFlow2_concat_extra_inputs"
  type: "Concat"
  bottom: "blob96"
  bottom: "blob94"
  bottom: "netFlow2_prev_depthnormal2_"
  top: "netFlow2_concat_extra_inputs"
  propagate_down: false
  propagate_down: false
  propagate_down: false
}
layer {
  name: "netFlow2_conv2_extra_inputsy"
  type: "Convolution"
  bottom: "netFlow2_concat_extra_inputs"
  top: "blob97"
  param {
    name: "flow_conv2_extra_inputsy_w"
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    name: "flow_conv2_extra_inputsy_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_ReLU5"
  type: "ReLU"
  bottom: "blob97"
  top: "blob97"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_conv2_extra_inputsx"
  type: "Convolution"
  bottom: "blob97"
  top: "netFlow2_conv_extra_inputs"
  param {
    name: "flow_conv2_extra_inputsx_w"
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    name: "flow_conv2_extra_inputsx_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_ReLU6"
  type: "ReLU"
  bottom: "netFlow2_conv_extra_inputs"
  top: "netFlow2_conv_extra_inputs"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_concat_conv2__conv_extra_inputs"
  type: "Concat"
  bottom: "netFlow2_conv2"
  bottom: "netFlow2_conv_extra_inputs"
  top: "netFlow2_conv2_concat"
}
layer {
  name: "netFlow2_conv2_1y"
  type: "Convolution"
  bottom: "netFlow2_conv2_concat"
  top: "blob98"
  param {
    name: "flow_conv2_1y_w"
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    name: "flow_conv2_1y_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    pad: 0
    kernel_size: 3
    kernel_size: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_ReLU7"
  type: "ReLU"
  bottom: "blob98"
  top: "blob98"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_conv2_1x"
  type: "Convolution"
  bottom: "blob98"
  top: "netFlow2_conv2_1"
  param {
    name: "flow_conv2_1x_w"
    lr_mult: 0
    decay_mult: 0.1
  }
  param {
    name: "flow_conv2_1x_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    pad: 1
    kernel_size: 1
    kernel_size: 3
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
    engine: CUDNN
  }
}
layer {
  name: "netFlow2_ReLU8"
  type: "ReLU"
  bottom: "netFlow2_conv2_1"
  top: "netFlow2_conv2_1"
  relu_param {
    negative_slope: 0.1
    engine: CUDNN
  }
}
#}}}
#{{{ 10900 900
layer {
  name: "netFlow2_conv3y"
